Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །འབད་དོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་རབ་ཏུ་འཇོག་གོ། །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ།
en: One strives for this, takes up discipline for its sake, reins in one’s thoughts, and makes a genuine resolution toward this end.

source: །སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ། །འབད་དོ། །བརྩོན་འགྲུས་རྩོམ་མོ།
en: “One forms a strong wish for the removal of evil and unwholesome dharmas that have already arisen.

source: །སེམས་རབ་ཏུ་འཇོག་གོ།
en: One strives for this, takes up discipline for its sake, reins in one’s thoughts, and makes a genuine resolution toward this end.

source: །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ། །དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ།
en: “One forms a strong wish that wholesome dharmas that have not yet arisen may arise.

source: །དེ་ལྟར་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པར་བྱ་བའི་ཕྱིར་ཐབས་ཚད་མེད་པ་བསྒོམས་པས་ཡོངས་སུ་གང་བའི་ཕྱིར་ཡོངས་སུ་གང་བར་གྱུར་པས་བསྒོམ་པ་དམ་པ་འཕེལ་བར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ། །འབད་དོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་རབ་ཏུ་འཇོག་གོ། །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ།
en: “In the same way, one forms a strong wish—one which increases by cultivating it more and more—for the wholesome dharmas that have arisen to remain, for complete fulfillment through the cultivation of immeasurable skillful means, and for the complete fulfillment of that which has not yet been fulfilled. One strives for this, takes up discipline for its sake, reins in one’s thoughts, and makes a genuine resolution to this end.

source: །འདི་རྣམས་ནི་ཡང་དག་པར་སྤོང་བ་བཞིའོ།
en: “These are the four right exertions.

source: །འདུན་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པར་བྱ་སྟེ།
en: “Now, for the four bases of miraculous power, one cultivates the miraculous power of the samādhi of aspiration accompanied by the formation of relinquishment.

source: བྱེ་བྲག་ཕྱེད་པས་ངེས་པར་འབྱུང་བ་དང་། འདོད་ཆགས་དང་བྲལ་བས་ངེས་པར་འབྱུང་བ་དང་། འགོག་པས་ངེས་པར་འབྱུང་བ་དང་། རྣམ་པར་བྱང་བར་གྱུར་པས་བདག་གི་འདུན་པ་ནུབ་པར་འགྱུར་ཞིང་ཤིན་ཏུ་རབ་ཏུ་འཇོག་པ་མ་ཡིན་པའོ།
en: This involves renunciation based on discrimination, the absence of desire, and the cessation of afflictions, leading to refinement in which one thinks, ‘May my aspiration not be too slack, may it not be too taut.’

source: །བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པར་བྱ་སྟེ།
en: “One cultivates the miraculous power of the samādhi of diligence accompanied by the formation of relinquishment.

source: བྱེ་བྲག་ཕྱེད་པས་ངེས་པར་འབྱུང་བ་དང་། འདོད་ཆགས་དང་བྲལ་བས་ངེས་པར་འབྱུང་བ་དང་། འགོག་པས་ངེས་པར་འབྱུང་བ་དང་། རྣམ་པར་བྱང་བར་གྱུར་པས་བདག་གི་བརྩོན་འགྲུས་ནུབ་པར་འགྱུར་ཞིང་ཤིན་ཏུ་རབ་ཏུ་འཇོག་པ་མ་ཡིན་པའོ།
en: This involves renunciation based on discrimination, the absence of desire, and the cessation of afflictions, leading to refinement in which one thinks, ‘May my diligence not be too slack, may it not be too taut.’

source: །དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པར་བྱ་སྟེ།
en: “One cultivates the miraculous power of the samādhi of investigation accompanied by the formation of relinquishment.

source: བྱེ་བྲག་ཕྱེ་པས་ངེས་པར་འབྱུང་བ་དང་། འདོད་ཆགས་དང་བྲལ་བས་ངེས་པར་འབྱུང་བ་དང་། འགོག་པས་ངེས་པར་འབྱུང་བ་དང་། རྣམ་པར་བྱང་བར་གྱུར་པས་བདག་གི་དཔྱོད་པ་ནུབ་པར་འགྱུར་ཞིང་ཤིན་ཏུ་རབ་ཏུ་འཇོག་པ་མ་ཡིན་པའོ།
en: This involves renunciation based on discrimination, the absence of desire, and the cessation of afflictions, leading to refinement in which one thinks, ‘May my investigation not be too slack, may it not be too taut.’

source: །སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པར་བྱ་སྟེ།
en: “One cultivates the miraculous power of the samādhi of mental activity accompanied by the formation of relinquishment.

source: བྱེ་བྲག་ཕྱེད་པས་ངེས་པར་འབྱུང་བ་དང་། འདོད་ཆགས་དང་བྲལ་བས་ངེས་པར་འབྱུང་བ་དང་། །འགོག་པས་ངེས་པར་འབྱུང་བ་དང་། རྣམ་པར་བྱང་བས་བདག་གི་སེམས་ནུབ་པར་འགྱུར་ཞིང་ཤིན་ཏུ་རབ་ཏུ་འཇོག་པ་མ་ཡིན་པའོ།
en: This involves renunciation based on discrimination, the absence of desire, and the cessation of afflictions, leading to refinement in which one thinks, ‘May my mental activity not be too slack, may it not be too taut.’

source: །འདི་རྣམས་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་སྟེ། འདོད་པར་སྤྱོད་པ་དང་བཅས་པའོ།
en: “These are the four bases of miraculous power.

source: །འཇིག་རྟེན་པའི་ཡང་དག་པའི་ལྟ་བ་ལ་དད་པར་བྱེད་དེ།
en: “Now, for the five faculties, one places one’s faith in the worldly correct view that is valid in the realm of desire. This means to develop conviction in the ripening of one’s karma.

source: རང་གི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་སོ་སོར་ཡིད་ཆེས་པར་གྱུར་པ་གང་ཞིག་དེ་ལྟར་ལས་བྱེད་པར་འགྱུར་བ་དགེ་བའམ་སྡིག་པ་དེ་དང་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བར་འགྱུར་བའི་ཕྱིར་དེ་ནི་འཚོ་བའི་རྒྱུར་ཡང་སྡིག་པའི་ལས་མངོན་པར་འདུ་མི་བྱེད་པའོ།
en: With the thought, ‘Whatever acts I am going to commit, whether wholesome or unwholesome, I acknowledge that they will bear results,’ one does not commit unwholesome acts even at the risk of losing one’s life.

source: །འདི་ནི་དད་པའི་དབང་པོར་གསུངས་སོ།
en: This is called the faculty of faith

source: །གང་ཞིག་ཆོས་རྣམས་ལ་དད་པའི་དབང་པོས་དད་པར་བྱེད་པའི་ཆོས་རྣམས་ལ་བརྩོན་འགྲུས་ཀྱི་དབང་པོས་ཤེས་པར་བྱེད་དོ།
en: “One acquires by means of the faculty of diligence whatever qualities one places one’s faith in using the faculty of faith.

source: །འདི་ནི་བརྩོན་འགྲུས་ཀྱི་དབང་པོར་གསུངས་སོ།
en: This is called the faculty of diligence

source: །གང་ཞིག་ཆོས་རྣམས་ལ་བརྩོན་འགྲུས་ཀྱི་དབང་པོས་ཤེས་པ་དེའི་ཆོས་རྣམས་ནི་དྲན་པའི་དབང་པོས་རབ་ཏུ་འཇོག་པར་མི་བྱེད་པའོ།
en: “With the faculty of mindfulness one is not in danger of destroying whatever qualities were acquired by means of the faculty of diligence.

source: །འདི་ནི་དྲན་པའི་དབང་པོར་གསུངས་སོ།
en: This is called the faculty of mindfulness

source: །གང་ཞིག་ཆོས་རྣམས་ལ་དྲན་པའི་དབང་པོས་རབ་ཏུ་འཇིག་པར་མི་བྱེད་པ་དེའི་ཆོས་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོས་རྩེ་གཅིག་ཏུ་བྱེད་པའོ།
en: “One brings one-pointed focus with the faculty of samādhi to the qualities that are safeguarded by the faculty of mindfulness.

source: །འདི་ནི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོར་གསུངས་སོ།
en: This is called the faculty of samādhi

source: །གང་ཞིག་ཆོས་རྣམས་ལ་ཏིང་ངེ་འཛིན་གྱི་དབང་པོས་རྩེ་གཅིག་ཏུ་བྱེད་པ་དེའི་ཆོས་རྣམས་ནི་ཤེས་རབ་ཀྱི་དབང་པོས་སོ་སོར་རིག་པ་སྟེ། དེ་ནི་ཆོས་དེ་དང་དེ་རྣམས་ལ་སོ་སོར་རྟོག་པ་སྐྱེ་བར་འགྱུར་རོ།
en: “One fully comprehends with the faculty of insight the qualities that one contemplates one-pointedly with the faculty of samādhi.

source: །འདི་ནི་ཤེས་རབ་ཀྱི་དབང་པོར་གསུངས་སོ།
en: This is called the faculty of insight

source: །དབང་པོ་ལྔ་པོ་འདི་རྣམས་འཕེལ་བ་ནི་སྟོབས་ལྔ་རུ་འགྱུར་ཏེ། དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཏེ།
en: “These five faculties develop into five powers, namely, (1) the power of faith, ( ) the power of diligence, (3) the power of mindfulness, (4) the power of samādhi, and (5) the power of insight.

source: འདི་རྣམས་ནི་སྟོབས་ལྔའོ།
en: These are the five powers.

source: །དེ་ལ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གང་ཞེ་ན།
en: “What in this list of thirty-seven factors are the seven aids to awakening?

source: འདི་ལྟ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ།
en: They are (1) the mindfulness aid to awakening, ( ) the examination of phenomena aid to awakening, (3) the diligence aid to awakening, (4) the contentment aid to awakening, (5) the serenity aid to awakening, (6) the samādhi aid to awakening, and (7) the equanimity aid to awakening.

source: བྱེ་བྲག་ཕྱེད་པས་ངེས་པར་འབྱུང་བ་དང་། འདོད་ཆགས་དང་བྲལ་བས་ངེས་པར་འབྱུང་བ་དང་། འགོག་པས་ངེས་པར་འབྱུང་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་བྲལ་བའི་ཀུན་ནས་རྣམ་པར་བྱང་བར་གྱུར་པ་དང་། ཆོས་རབ་ཏུ་འབྱེད་པ་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སོགས་པ་བསྒོམ་པའོ།
en: These involve renunciation based on discrimination, the absence of desire, and cessation, and lead to total refinement in which one becomes completely free of afflictions. One should cultivate these seven aids to awakening, the examination of phenomena, and so forth.

source: །དེ་ལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་གང་ཞེ་ན།
en: “And what is the noble eightfold path?

source: ཡང་དག་པའི་ལྟ་བ་ནི་གང་ཞིག་འཇིག་རྟེན་ལས་འདས་པ་སྟེ།
en: The correct view, which transcends the mundane sphere, is not being motivated by the belief in a soul

source: བདག་ཏུ་ལྟ་བས་ཀུན་ནས་བསླང་བ་མ་ཡིན་པ་དང་། སེམས་ཅན་མེད་པ་དང་། འཚོ་བ་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། སྐྱེས་བུ་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། ཤེད་ལས་སྐྱེས་མེད་པ་དང་། ཤེད་བུ་མེད་པ་དང་། བྱེད་པ་པོ་མེད་པ་དང་། ཚོར་བ་པོ་མེད་པའི་ལྟ་བས་ཀུན་ནས་བསླང་བ་ཆང་བ་མ་ཡིན་པ་དང་། རྟག་པར་ལྟ་བས་ཀུན་ནས་བསླང་བ་མ་ཡིན་པ་དང་། སྲིད་པ་དང་བྲལ་བའི་ལྟ་བས་ཀུན་ནས་བསླང་བ་དང་། རིགས་སུ་ལུང་བསྟན་པའི་ལྟ་བས་ཀུན་ནས་བསླང་བ་དང་། ཇི་སྲིད་འཁོར་བ་མ་ཡིན་ཞིང་མྱ་ངན་ལས་འདས་པའི་ཡང་མ་ཡིན་པའི་ལྟ་བས་ཀུན་ནས་བསླང་བ་སྟེ།
en: It is being motivated instead by the belief that there is no being , psyche , spirit , person , human , agent , or experiencer ; no annihilation or eternal enduring; no existence or nonexistence; and no distinction between virtuous and nonvirtuous, all the way up to no saṃsāra and no nirvāṇa.

source: འདི་ནི་ཡང་དག་པའི་ལྟ་བར་གསུངས་སོ།
en: This is called the correct view

source: །གང་ཞིག་ཡང་དག་པའི་རྟོག་པ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཉོན་མོངས་པས་ཀུན་ནས་བསླང་བའི་རྟོག་པ་དེ་ནི་ཡང་དག་པའི་རྟོག་པར་མི་འགྱུར་རོ། །ཡང་དག་པའི་རྟོག་པ་གང་ཞིག་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོས་ཀུན་ནས་སློང་བ་དེའི་ཡང་དག་པའི་རྟོག་པ་དེ་ནི་ཡང་དག་པའི་རྟོག་པར་འགྱུར་ཏེ།
en: “Thoughts through which arise the afflictions of desire, hatred, and delusion, are thoughts that one should avoid. Thoughts through which arise an abundance of morality, meditative absorption, insight, liberation, and vision into the wisdom of liberation, are thoughts that one should have.

source: འདི་ནི་ཡང་དག་པའི་རྟོག་པར་གསུངས་སོ།
en: These are called correct thoughts

source: །གང་ཞིག་ཚིག་གིས་བདག་ལ་གདུང་བར་མི་བྱ་ཞིང་གཞན་ལ་གདུང་བར་མི་བྱ་བ་དང་། བདག་ལ་ཉོན་མོངས་པར་མི་བྱ་ཞིང་གཞན་དག་ལ་ཉོན་མོངས་པར་མི་བྱ་བ་དང་། བདག་ལ་མི་དཔྱ་ཞིང་གཞན་དག་ལ་ཡང་དཔྱ་བར་མི་བྱ་བ་སྟེ། དེ་མཉམ་པར་གཞག་པ་དང་ལྡན་པས་ཚིག་དང་ལྡན་པར་འགྱུར་ཞིང་།
en: “One should use speech that hurts neither oneself nor others, causes no distress to oneself or others, and is not derisive of oneself or others.

source: གང་གི་ཚིག་གིས་ཡང་དག་པའི་འཕགས་པར་འཇུག་པར་འགྱུར་བ་འདི་ནི་ཡང་དག་པའི་ངག་ཅེས་གསུངས་སོ།
en: By applying one’s attention to this one becomes endowed with this speech, through which one enters the correct noble path. This is called correct speech . “One should not commit acts that are negative, and whose results are negative. One should perform acts that are positive, and whose results are positive. One should not commit acts that are positive, but whose results are negative.

source: །གང་ཞིག་ལས་ནག་པོ་དང་ནག་པོའི་རྣམ་པར་སྨིན་པ་དེའི་ལས་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། གང་ཞིག་ལས་དཀར་བ་དང་དཀར་པོའི་རྣམ་པར་སྨིན་པ་དེའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དང་། གང་ཞིག་ལས་དཀར་པོ་དང་། ནག་པོའི་རྣམ་པར་སྨིན་པ་དེའི་ལས་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། གང་ཞིག་ལས་དཀར་པོ་དང་། ནག་པོ་དང་། དཀར་པོའི་རྣམ་པར་སྨིན་པ་དང་། ནག་པོ་ཟད་པའི་བསམ་པས་གནས་པ་དེའི་ལས་མངོན་པར་འདུ་བྱེད་དེ།
en: One may commit acts that are negative, but whose results are positive and lead to reducing the negative.

source: དམ་པའི་ལས་ལྟ་བུར་འགྱུར་བ་ནི་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་སྟེ།
en: Relying on virtuous acts is the correct activity.

source: འདི་ནི་ཡང་དག་པའི་ལས་ཀྱི་མཐར་གསུངས་སོ།
en: This is called correct activity

source: །གང་གི་ཚེ་འཕགས་པ་ལྟ་བུར་དུལ་བ་དང་། ཡོན་ཏན་ཡང་དག་པའི་ཆས་ཞུམ་ཞིང་དུལ་བ་དང་། ཁ་གསག་མེད་པ་དང་། མང་དུ་སྨྲ་བ་མ་ཡིན་པ་དང་། གཏམ་ལ་མི་དགའ་བ་དང་། རང་གི་སྤྱོད་པའི་ཚུལ་ཁྲིམས་དང་། འཇིག་རྟེན་ཕ་རོལ་གྱི་དབང་ཕྱུག་དང་ལྡན་པ་དང་། བདག་གི་རྙེད་པ་ཁ་ན་མ་ཐོ་བ་མེད་པས་བདག་ཆོག་པར་འཛིན་པ་དང་། འཕགས་པའི་བཀའི་གནག་བས་འཚོ་བ་སྟེ། འདི་ནི་ཡང་དག་པའི་འཚོ་བར་གསུངས་སོ།
en: Correct livelihood is when one’s livelihood is restrained, like that of the noble ones, and strictly follows the tenets of virtue, when it is free of hypocrisy, when it does not involve too much talking, when it is not embellished by stories, when one’s conduct has moral integrity, when it does not involve envy of the gains of others, when one is content with one’s blameless gains, and when it is recommended by the noble ones.

source: །རྩོལ་བ་ནི་གང་ཞིག་བརྫུན་དང་། འཕགས་པས་མ་གནང་བ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཉོན་མོངས་པ་རྗེས་སུ་བསྟེན་པར་མི་འདོད་པ་ནི་རྩོལ་བ་སྟེ།
en: “One should avoid wrong effort, not recommended by the noble ones, that relies on desire, hatred, ignorance, and other afflictions.

source: རྩོལ་བ་གང་ཞིག་ཡང་དག་པའི་འཕགས་པའི་ལམ་གྱི་བདེན་པར་འཇུག་ཅིང་མྱ་ངན་ལས་འདས་པར་འགྲོ་བ་དང་། སོ་སོའི་གནས་སུ་སྐྱེད་པར་བྱེད་པ་དེ་ནི་རྩོལ་བར་ཡང་དག་པར་རྗེས་སུ་འབྲང་བ་སྟེ།
en: Instead, one should pursue the effort that brings one to the genuine truth of the noble ones’ path, lays out the path leading to nirvāṇa, and delivers one to each successive stage.

source: འདི་ནི་ཡང་དག་པའི་རྩོལ་བར་གསུངས་སོ།
en: This is called correct effort

source: །གང་ལ་ཉེ་བར་གནས་པ་དེ་ནི་རབ་ཏུ་མི་གཡོ་བ་དང་། ལུས་དྲང་པོས་ཀྱོག་པོ་མ་ཡིན་པ་དང་། འཁོར་བའི་སྐྱོན་སྣ་ཚོགས་ལ་སོགས་པ་དབང་དུ་བྱེད་པ་སྟོན་ཅིང་། མྱ་ངན་ལས་འདས་པའི་གནས་འདོད་པའི་དྲན་པ་ནི་མི་བརྗེད་པ་སྟེ། འདི་ནི་འཕགས་པའི་ཡང་དག་པའི་ལམ་ལ་སྦྱོར་བའོ།
en: “The mindfulness in which one’s repose is unshakable, one’s body is straight and not crooked, one is able to see the shortcomings, and so forth, of saṃsāra, and by which one is led to the path to nirvāṇa, is a non-forgetting that connects one to the correct path of the noble ones.

source: །འདི་ནི་ཡང་དག་པའི་དྲན་པར་གསུངས་སོ།
en: This is called correct mindfulness

source: །ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ནི་ཏིང་ངེ་འཛིན་གང་ལ་གནས་ནས་སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་ཐར་བར་བྱ་བའི་ཕྱིར་ཡང་དག་པར་གནས་ཏེ། མྱ་ངན་ལས་འདས་པ་མནན་པའོ།
en: “A samādhi engaged in correctly is the meditative absorption by abiding in which one abides in the right way for the sake of liberating all beings and thus reaches nirvāṇa.

source: །འདིས་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཞེས་གསུངས་སོ། །དེ་ཉིད་ཡང་དག་བཤད་པ་ནི།
en: This is called correct samādhi

source: །དགའ་བ་ལ་སོགས་ས་རྣམས་ཏེ།
en: “The bodhisattva levels of Joyful, and so forth,

source: །དབང་པོ་ལ་སོགས་རང་བཞིན་གྱི།
en: Which are enumerated as such,

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གནས།
en: Are the bodhisattva abodes,

source: །ཕུང་པོ་ལ་སོགས་ཁྱད་པར་གྱི།
en: Whose natures are the sense faculties, and so forth;

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ནི་གནས།
en: “The abodes of all buddhas, Which are the particular aspects of the aggregates, and so forth; And are the ultimate vehicles of awakening

source: །སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་ཡི།
en: For buddhas and bodhisattvas.

source: །སངས་རྒྱས་ཉིད་ནི་མཆོག་ཏུ་འབབ།
en: “When the subtle energy channels in this body

source: །བྱང་སེམས་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས། །གང་ཚེ་འདིར་ནི་གང་གྱུར་པ།
en: Become filled with the thirty-two types of bodhicitta,

source: །དབང་པོ་ཕུང་པོ་འབྱུང་བ་ཡི།
en: The awakening of the sense faculties, Aggregates, and elements will happen instantly,

source: །སངས་རྒྱས་དེ་ཡི་དེ་མ་ཐག །རང་ལུས་ཉིད་ལ་སངས་རྒྱས་ཉིད།
en: “For awakening is based in one’s own body

source: །གཞན་ནི་གང་དུའང་མི་གནས་སོ།
en: And nowhere else.

source: །ལུས་ལས་གཞན་དུ་སངས་རྒྱས་ཉིད། །མི་ཤེས་པ་ཡིས་བསྒྲིབས་པར་བརྗོད།
en: Only those steeped in ignorance Regard awakening to be somewhere other than the body.

source: །ཡེ་ཤེས་ཆེན་པོ་རང་ལུས་གནས།
en: “In one’s own body dwells great wisdom,

source: །རྟོག་པ་ཐམས་ཅད་ཡང་དག་སྤངས།
en: Free of all mental constructs.

source: །དངོས་པོ་ཀུན་ལ་ཁྱབ་པ་པོ།
en: Pervading all things,

source: །ལུས་གནས་ལུས་ལ་མ་སྐྱེས་པའོ། །རྡོ་རྗེ་སྙིང་པོས་གསོལ་བ།
en: It dwells in the body, but is not born of the body.”

source: །ལུས་ལ་རྩ་དུ་ལགས།
en: Vajragarbha asked, “What subtle energy channels are in the body?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཁོར་ལོ་བཞི་ཡི་རབ་དབྱེ་བས། །བརྒྱ་ཕྲག་གཅིག་དང་ཉི་ཤུ་ལྷག།
en: The Blessed One said, “There are one hundred and twenty of them, corresponding to the divisions within the four cakras.

source: །བྱང་ཆུབ་སེམས་ཀྱི་རང་བཞིན་གྱིས། །རྩ་རྣམས་སུམ་ཅུ་རྩ་གཉིས་མཆོག །གསུངས་པ།
en: The chief ones, those with bodhicitta as their innate nature, are thirty-two in number.

source: འདི་ལྟ་སྟེ།
en: They are: “Abhedyā, Sūkṣmarūpā,

source: མི་ཕྱེད་མ་ཞེས་བརྗོད་པ་དང་། ཕྲ་གཟུགས་མ་དང་། རྩེ་བ་མ་དང་། །གཡོན་པ་མ་དང་། ཐུང་ངུ་མ་དང་། རུས་སྦལ་སྐྱེས་མ་དང་། །སྒོམ་པ་མ་དང་། དབང་མ་དང་། སྐྱོན་མ་དང་། འཇུག་མ་དང་། །མ་མོ་དང་། མཚན་མོ་དང་། །བསིལ་སྦྱིན་མ་དང་། །ཚ་བ་མ་དང་། བརྐྱང་མ་དང་། །རོ་མ་དང་། །ཀུན་འདར་མ་དང་། །འབབ་མ་དང་། རངས་མ་དང་། མདོག་མ་དང་། གཟུགས་ཅན་མ་དང་། སྤྱི་མ་དང་། རྒྱུ་སྦྱིན་མ་དང་། སྦྱོར་བྲལ་མ་དང་། སྡུག་གུ་མ་དང་། གྲུབ་མ་དང་། འཚེད་མ་དང་། དེ་བཞིན་དུ་ཡིད་བཟང་མ་དང་། སུམ་སྐོར་མ་དང་། འདོད་མ་དང་། ཁྱིམ་མ་དང་། གཏུམ་མོ་དང་། བདུད་འདྲ་ལམ་འོ།
en: Divyā, Vāmā, Vāmanī, Kūrmajā, Bhāvakī, Sekā, Doṣā, Viṣṭā, Mātarī, “Śarvarī, Śītadā, Uṣmā, Lalanā, Rasanā, Avadhūtī, Pravaṇā, Hṛṣṭā, Varṇā, Surūpiṇī, Sāmānyā, Hetudāyikā, “Viyogā, Premaṇī, Siddhā, Pāvakī, Sumanas, Trivṛttā, Kāminī, Gehā, Caṇḍikā, and Māradārikā.”

source: །བཅོམ་ལྡན་འདས་རྩ་འདི་དག་ཇི་ལྟ་བུ་ལགས།
en: Vajragarbha asked, “Of what kind are these channels, O Blessed One?”

source: སྲིད་གསུམ་ཡོངས་སུ་གྱུར་པ་སྟེ། གཟུང་བ་དང་འཛིན་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པའོ།
en: The Blessed One replied, “They all are permutations of the threefold existence, and are entirely devoid of apprehended object and apprehending subject.”

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་མཐར་ཐུག་པ་ལ་སོགས་པའི་རྣམ་པར་འགྲེལ་པ་བྱང་ཆུབ་ཀྱི་སེམས་འཇུག་པ་ཞེས་བྱ་བ་སྟེ་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།།
en: This concludes the second part of the first chapter, called “Applying Bodhicitta,” which includes a full exposition on the five faculties, the five powers, the seven aids to awakening, and the noble eightfold path.

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པ་བྱས་ནས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གསང་བའི་ཡེ་ཤེས་བླ་མེད་པ། །སྙིང་པོ་བཅོམ་ལྡན་བཤད་དུ་གསོལ།
en: Then all the tathāgatas, having paid reverence and prostrated to the Blessed One, said, “Please teach us, O Blessed One, the secret, pithy wisdom that has no equal.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསོལ་བ་བཏབ་པར་མཁྱེན་ནས། རྒྱུད་ཐམས་ཅད་ཀྱི་སྙིང་པོ་ཡེ་ཤེས་མར་མེ་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། རྒྱུད་ཐམས་ཅད་ཀྱི་གསང་བ་འདི་བཀའ་སྩལ་པ།
en: The Blessed One, acknowledging the request made by all the tathāgatas, entered the meditative absorption called “the vajra lamp of wisdom that is the essence of all the tantras” and expounded this secret of all the tantras:

source: གསང་བ་མཆོག་གི་དགྱེས་པ་ན།
en: “Always abiding in the pleasure of the supreme secret,

source: །ཐམས་ཅད་བདག་ཉིད་རྟག་ཏུ་བཞུགས།
en: Which is of the nature of everything,

source: །སངས་རྒྱས་ཀུན་དངོས་སེམས་དཔའ་ནི།
en: He is the being who comprises all buddhas—

source: །རྡོ་རྗེ་སེམས་དཔའ་བདེ་བའི་མཆོག །འདི་ནི་བཅོམ་ལྡན་རྣལ་འབྱོར་ཏེ།
en: Vajrasattva, the ultimate bliss. “For this Blessed One is union—

source: །བརྟན་པ་རྟག་པ་མཆོག་ཏུ་ཡང་།
en: Eternal, stable, and supreme.

source: །ཡིད་སྲུབ་སོ་སོར་སྐྱེས་པ་ཉིད།
en: He manifests as Manmatha,

source: །རྟག་ཏུ་རང་བཞིན་མནན་དཀའ་བ།
en: Always invincible by nature.

source: །སྣ་ཚོགས་ལས་ཀྱི་རྣལ་འབྱོར་གྱིས།
en: “Because of their performance of different actions

source: །སྣ་ཚོགས་ཆོ་ག་འདོད་པ་ཡི།
en: People want different ritual procedures.

source: །སངས་རྒྱས་རྡོ་རྗེ་འཛིན་སོགས་རྣམས།
en: It is in this sense that Buddha Vajradhara and others

source: །སེམས་ཅན་རྣམས་ནི་འདུལ་བར་བརྗོད།
en: Are said to discipline sentient beings. “He, Vajrasattva, is all things,

source: །སངས་རྒྱས་ཀུན་སོགས་བརྟན་དང་གཡོ།
en: Animate and inanimate, starting with all the buddhas.

source: །ཐམས་ཅད་དངོས་པོ་སྲིད་པ་འདི།
en: He is the deity Ḍākinījālasaṃvara

source: །སངས་རྒྱས་ཀུན་དང་མཉམ་སྦྱོར་བ། །མཁའ་འགྲོ་མ་ཡི་དྲ་བ་སྡོམ།
en: Who is in union with all the buddhas.

source: །འདིས་ནི་སྒྱུ་མའི་རྣལ་འབྱོར་གྱིས།
en: “Because of his being in this magical union,

source: །ཐམས་ཅད་ལས་ནི་སྣ་ཚོགས་མཆོག །སངས་རྒྱས་སོགས་པས་འདུལ་བའི་ཕྱིར།
en: Everything is perfect in every way. Because of being trained by buddhas, and so forth,

source: །དངོས་གྲུབ་སེམས་ཅན་ཀུན་དོན་མཆོག །རང་གི་ངོ་བོས་ཡོངས་བསྒྱུར་བས།
en: The ultimate aim of beings is accomplished.

source: །བུད་མེད་སྒྱུ་མ་ཐམས་ཅད་འགྲུབ།
en: “All the powers of women are accomplished By means of different transformations, according to their natures. Even women of bad conduct attain fulfillment With every possible gain, pleasure, and enjoyment.

source: །སྣ་ཚོགས་སྒྱུ་མའི་ཕྱག་རྒྱ་འདི།
en: “This consort with various magical powers Is called ḍākinī in the language of the barbarians.

source: །མཁའ་འགྲོ་མ་ཞེས་ཀླ་ཀློའི་སྐད།
en: The verbal root ḍai , which means ‘traveling in the sky,’

source: །ཌཻ་བཻ་ཧཱ་ཡ་སར་འགྲོ་བར།
en: Should be understood here as the etymology of ḍākinī

source: །སྐད་དབྱིངས་འདི་ནི་རྣམ་པར་བརྟག །ནམ་མཁའ་ཀུན་ཏུ་སྤྱོད་འགྲུབ་པས།
en: “Traveling throughout the entirety of space is a magical feat—

source: །མཁའ་འགྲོ་མ་ཞེས་རབ་ཏུ་གྲགས།
en: The name ḍākinī indicates that she can accomplish this.

source: །ཀུན་ནས་སྣ་ཚོགས་ཕྱག་རྒྱ་སྟེ།
en: In every way, she is the universal consort

source: །ཀུན་ལས་སྣ་ཚོགས་སྡོམ་པའོ།
en: Joining in union with every Saṃvara.

source: །རྡོ་རྗེ་རྡོ་རྗེ་འཛིན་པ་ཉིད།
en: “Vajra and Vajradhara

source: །པདྨ་དེ་བཞིན་པདྨ་འཛིན།
en: Lotus and Padmadhara

source: །ནོར་བུ་ནོར་བུ་འཛིན་པ་ཉིད།
en: Jewel and Maṇidhara

source: །འདི་རྣམས་ཀྱི་ནི་རིགས་རྣམས་ཡིན།
en: These are the Saṃvaras and their respective families.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་རྡུལ་དང་བྲལ་བའི་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། །བྱང་ཆུབ་ཀྱི་སེམས་འདི་བཀའ་སྩལ་པ།
en: Now the Blessed One entered the meditative absorption called “the stainless seat of the overpowering ability of all the tathāgatas” and explained bodhicitta.

source: སྟོང་མིན་སྟོང་པ་མིན་པའང་མིན།
en: “It is neither empty nor not empty,

source: །དབུ་མར་དམིགས་པར་མི་འགྱུར་ཏེ།
en: Nor can it be in the middle between these two.

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་སྦྱོར་བ།
en: Its application is the perfection of insight

source: །ཐབས་ནི་སྙིང་རྗེའི་བདག་ཉིད་དེ།
en: And its means is compassion itself. “Consequently, the perfection of insight,

source: །དེ་ནས་མཛེས་པའི་སྙིང་རྗེ་ཐབས། །ཤེས་རབ་ཕ་རོལ་ཕྱིན་གསལ་བ།
en: With the skillful means of sublime compassion, is clarified.

source: །རྣམ་རྟོག་མེད་པའི་ཆོས་རྣམས་ལ།
en: With respect to phenomena free of conceptuality,

source: །དངོས་པོ་མེད་ཅིང་སྒོམ་པའང་མེད།
en: There is no entity and nothing to cultivate. “Also, one should perform all mental activity

source: །རྣམ་རྟོག་མེད་པས་རྟག་མོས་པས། །བརྟག་པ་ཀུན་གྱིས་བརྟག་པར་བྱ།
en: Inclined toward nonconceptuality. One’s thoughts for the benefit of beings

source: །སེམས་ཅན་དོན་ནི་ཡོངས་སུ་བརྟག །དེ་བཞིན་གཤེགས་པ་ཀུན་བདག་ཆོས།
en: “Phenomena all have the nature of the tathāgatas—

source: །ཆོས་ཅན་མེད་ཅིང་ཆོས་ཉིད་མེད། །སྒྲ་བརྙན་ལྟ་བུར་མཉམ་པ་ཉིད།
en: There is neither a possessor of qualities, nor the condition of being a quality.

source: །དེ་ནས་འདི་ནི་ཆོས་ངག་འབྱུང་།
en: This talk about phenomena is therefore The same as the sound of an echo.”

source: །དེ་ནས་ཐེག་པ་ཆེན་པོ་ལས་བྱུང་བའི་བསྒོམ་པས་ཡོན་ཏན་རྒྱས་པ་རྣམས་ཀྱིས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བསྟོད་པའི་རྒྱལ་པོ་འདིས་ཡང་དག་པར་བསྟོད་པ།
en: Then, because of the vast scope of qualities Arising through the meditation of the Great Vehicle, All the tathāgatas of the three times Expressed their praise with this king of eulogies:

source: །རྣལ་འབྱོར་གྱི་བདག་པོ་སེམས་ཅན་གྲོལ་བར་མཛད་པ་ལ་བསྟོད་ཅིང་ཕྱག་འཚལ་ལོ།
en: “Homage to the king of yoga, the liberator of beings!

source: །སེམས་ཅན་བདག་ཉིད་སྐྱེས་པ་གཅིག་པར་མཛད་པ་ལ་བསྟོད་ཅིང་ཕྱག་འཚལ་ལོ།
en: Homage to the meditator on oneness arising as the universal nature!

source: །འཁོར་བའི་རྒྱ་མཚོའི་གཏི་མུག་གཅོད་པར་མཛད་པ་ལ་བསྟོད་ཅིང་ཕྱག་འཚལ་ལོ།
en: Homage to the destroyer of ignorance in the ocean of saṃsāra!
